---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength
source: html/c998f095-1d01-289e-fc40-390af9175e0b.htm
---
# RebarShapeConstraintSegmentLength Methods

Return the Id of the parameter associated with this constraint.